{
  "_comment": [
    "Entity type IDs must match backend/graph/entities_edges.py:",
    "  0 = Entity (fallback)",
    "  1 = Person",
    "  2 = Place",
    "  3 = Group",
    "  4 = Activity",
    "Update this comment block when entity types change."
  ],
  "examples": [
    {
      "_persona": "Mid-30s millennial, software-adjacent job, long-term relationship, intellectualizes emotions but learning to feel them",
      "_modes": "1 (sequential names), 2 (time modifiers), 3 (possessives/normalization)",
      "episode_content": "Priya's been stressed about her mom visiting next week and I think its starting to get to both of us. She snapped at me this morning over something dumb and I just... didn't engage. Made breakfast, kept it moving. Kenji came by later which was actually perfect timing - forgot how much I missed just shooting the shit with him. Talked for like 2 hours about everything, his job stuff, my situation with Priya, life. He's good at listening without trying to fix things you know?\n\nDid a meditation after he left. Needed to get out of my head.\n\nMet up with Wei for a late lunch at Tamarind Kitchen. Hadn't seen them since the wedding and it was nice to catch up one on one without the wedding crew being chaotic. They're thinking about moving back to Vancouver which is wild, always assumed they'd be here forever.",
      "expected_entities": [
        {"name": "Priya", "entity_type_id": 1},
        {"name": "Priya's mom", "entity_type_id": 1},
        {"name": "Kenji", "entity_type_id": 1},
        {"name": "Wei", "entity_type_id": 1},
        {"name": "meditation", "entity_type_id": 4},
        {"name": "Tamarind Kitchen", "entity_type_id": 2},
        {"name": "Vancouver", "entity_type_id": 2},
        {"name": "wedding crew", "entity_type_id": 3}
      ]
    },
    {
      "_persona": "Early 20s, recent college grad, broke, socially active, writes in bursts with drama",
      "_modes": "4 (granularity - no rooms/furniture), 5 (compound parsing - venue in city)",
      "episode_content": "Dragged myself to brunch with Dmitri and Yuki at Cafe Lumiere in Montclair. Honestly couldn't afford it but Yuki was like \"you never come out anymore\" and guilt tripped me into it lmao. We tried sitting on the patio but it was hot as balls so we moved inside. Food was overpriced for what it was but whatever, I needed to get out of my apartment before I lost my mind.\n\nYuki's going through it rn, her situationship with that guy from her job finally imploded. Dmitri and I just listened and nodded for like an hour straight. The broke bitches do what we do best. Then she found some random bookstore downtown and completely forgot she was sad, spent 20 mins digging through shelves for a copy of Acts of Service. We just stood there like ok I guess were doing this now. Got boba after because I already blew my budget so why not. Retail therapy with these two is dangerous for my bank account but I regret nothing.",
      "expected_entities": [
        {"name": "Dmitri", "entity_type_id": 1},
        {"name": "Yuki", "entity_type_id": 1},
        {"name": "Cafe Lumiere", "entity_type_id": 2},
        {"name": "Montclair", "entity_type_id": 2},
        {"name": "broke bitches", "entity_type_id": 3},
        {"name": "Acts of Service", "entity_type_id": 0},
        {"name": "retail therapy", "entity_type_id": 4}
      ]
    },
    {
      "_persona": "Late 40s, immigrant healthcare worker (15 yrs in US), parent of teenager, tired but present",
      "_modes": "2 (activities as nouns), 6 (action vs entity confusion)",
      "episode_content": "Long day at the hospital, longer than usual even. Monday is always like this because weekend team leaves everything half done. Spent first two hours just figuring out what happened while I was gone. Finally got to do actual patient care after lunch which is the part I actually like about this job.\n\nFatima from pharmacy came up to discuss new medication protocol. I like working with her, she is thorough, checks everything twice. We went over the changes together, took longer than expected but worth it. Omar caught me later in the hallway, stressed about staffing again. Short two nurses next month. I told him we will manage, we always do. But honestly I am tired of always managing.\n\nTook a few minutes for Asr prayer in the break room after Omar left. Needed to clear my head.\n\nLeft late to pick up Sana from dance practice at Encore Academy. She was quiet in the car which is not like her, usually talks the whole way home about the dance team and what everyone is working on. I ask whats wrong and she gives me the \"I'm fine\" with that voice. You cannot push teenagers, learned this the hard way. So I just drove and let the quiet be quiet. After dinner we played backgammon like we used to when she was little. She won twice. Watched an episode of The Bear together after, nice to see her smile again.",
      "expected_entities": [
        {"name": "Fatima", "entity_type_id": 1},
        {"name": "Omar", "entity_type_id": 1},
        {"name": "Sana", "entity_type_id": 1},
        {"name": "Asr prayer", "entity_type_id": 4},
        {"name": "dance practice", "entity_type_id": 4},
        {"name": "backgammon", "entity_type_id": 4},
        {"name": "Encore Academy", "entity_type_id": 2},
        {"name": "dance team", "entity_type_id": 3},
        {"name": "The Bear", "entity_type_id": 0}
      ]
    },
    {
      "_persona": "New parent, sleep deprived, grateful for any help, writes in fragmented bursts",
      "_modes": "1 (names near punctuation), 3 (normalization - typo resilience)",
      "episode_content": "Nina slept for four hours straight last night. FOUR HOURS. I almost cried. Michael took the morning shift so I could actually shower for once, bless that man.\n\nMom, Auntie Rosa, Tia, and Juno all came by around noon with food from Pho 75. Didnt even have to ask, they just knew. Took turns holding Nina while I ate with both hands like a human being. Forgot what that felt like.\n\nThe new parents group zoom was actually helpful today? Usually I zone out but someone recommended Goodnight Moon for the bedtime routine and now micheal and I read it every night. She loves it.\n\nNina!!! She smiled at me for real this time, not just gas. Im not crying ur crying.",
      "expected_entities": [
        {"name": "Nina", "entity_type_id": 1},
        {"name": "Michael", "entity_type_id": 1},
        {"name": "mom", "entity_type_id": 1},
        {"name": "Auntie Rosa", "entity_type_id": 1},
        {"name": "Tia", "entity_type_id": 1},
        {"name": "Juno", "entity_type_id": 1},
        {"name": "Pho 75", "entity_type_id": 2},
        {"name": "new parents group", "entity_type_id": 3},
        {"name": "Goodnight Moon", "entity_type_id": 0},
        {"name": "bedtime routine", "entity_type_id": 4}
      ]
    },
    {
      "_persona": "Type-A business exec, mid-40s, high-functioning, doesn't realize every story involves alcohol",
      "_modes": "4 (granularity - work jargon not extracted), 5 (compound parsing - business entities)",
      "episode_content": "Solid day. Closed the Meridian deal finally, been chasing that one for months. Took the team out to Flemings to celebrate, felt like the right move. Good energy, everyone needed the win.\n\nHad drinks with Patrick after at the hotel bar downstairs. Hes the CFO contact at Meridian, sharp guy. We talked through the integration timeline, knocked out a few bourbons. Productive honestly, some of the best conversations happen after hours.\n\nGolf tomorrow with the advisory board at Pinehurst. Listened to How I Built This on the drive home, always gets me fired up. Need to prep for the Kensington pitch, might bring it up on the back nine. Thats where the real work gets done if you ask me.\n\nGrabbed a nightcap at home while finishing Never Split the Difference. Need to be sharper for the presentation but I work well under pressure.",
      "expected_entities": [
        {"name": "Patrick", "entity_type_id": 1},
        {"name": "Flemings", "entity_type_id": 2},
        {"name": "Pinehurst", "entity_type_id": 2},
        {"name": "Meridian", "entity_type_id": 3},
        {"name": "Kensington", "entity_type_id": 3},
        {"name": "advisory board", "entity_type_id": 3},
        {"name": "golf", "entity_type_id": 4},
        {"name": "How I Built This", "entity_type_id": 0},
        {"name": "Never Split the Difference", "entity_type_id": 0}
      ]
    },
    {
      "_persona": "Creative freelancer, late 20s, works from coffee shops, juggles tools and projects",
      "_modes": "5 (slash-separated lists, possessive place names), 2 (using X pattern)",
      "episode_content": "Productive morning at Rosie's, finally got into a flow state. Been experimenting with Figma/Framer trying to figure out which works best for prototyping. Think Im landing on Framer but still not sure.\n\nSaw a post about a design meetup next week. Might actually go this time, been too hermit mode lately. Could use some human interaction that isnt through a screen.\n\nLunch with Quinn to talk about the rebrand hes been working on. We sat outside at Marco's, nice to catch up. He convinced me to try using Notion for project tracking instead of my chaos spreadsheet. We'll see.",
      "expected_entities": [
        {"name": "Quinn", "entity_type_id": 1},
        {"name": "Rosie's", "entity_type_id": 2},
        {"name": "Marco's", "entity_type_id": 2},
        {"name": "Figma", "entity_type_id": 0},
        {"name": "Framer", "entity_type_id": 0},
        {"name": "design meetup", "entity_type_id": 3},
        {"name": "Notion", "entity_type_id": 0},
        {"name": "prototyping", "entity_type_id": 4}
      ]
    }
  ]
}
